frontend/controllers/BookingController.php

    public function actionCreate()
    {
        $model = new Booking();
        $model->active = 1;

        if ($model->load(Yii::$app->request->post())) {

            $timeSlot = $model->time_slots_is;

            $totalNumberOfSeats = \frontend\models\TimeSlots::findOne($timeSlot);

            // echo "<prE>";
            // print_r($totalNumberOfSeats);
            // exit;

            if( $model->save()){
---
SELECT EXISTS(SELECT * FROM `time_slots` WHERE `time_slots`.`id`='3')
INSERT INTO `booking` (`active`, `flight_id`, `customer_id`, `time_slots_is`) VALUES (1, 2, 1, 3)

    protected function findModel($id)
    {
        if (($model = Booking::findOne($id)) !== null) {
---
SELECT * FROM `booking` WHERE `id`='2'