frontend/controllers/FlightController.php

    public function actionCreate()
    {
        $model = new Flight();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
---
INSERT INTO `flight` (`name`, `number`, `seats`) VALUES ('Enbd', 'EN110', 5)

    public function actionLists($id)
    {
        $posts = \frontend\models\TimeSlots::find()
				->where(['flight_id' => $id])
				->orderBy('id DESC')
				->all();
---
SELECT * FROM `time_slots` WHERE `flight_id`='2' ORDER BY `id` DESC

    protected function findModel($id)
    {
        if (($model = Flight::findOne($id)) !== null) {
---
SELECT * FROM `flight` WHERE `id`='2'