frontend/controllers/TimeSlotsController.php

    public function actionCreate()
    {
        $model = new TimeSlots();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
---
INSERT INTO `time_slots` (`flight_id`, `time_slot`, `date`) VALUES (2, '12:10', '2021-07-02')

    protected function findModel($id)
    {
        if (($model = TimeSlots::findOne($id)) !== null) {
---
SELECT * FROM `time_slots` WHERE `id`='3'