frontend/views/booking/_form.php

SELECT * FROM `flight`
---
//       });
//   '

$dataCategory=ArrayHelper::map(\frontend\models\Flight::find()->asArray()->all(), 'id', 'name');

SELECT * FROM `customer`
---
    ?>

<?php
$customerList = ArrayHelper::map(\frontend\models\Customer::find()->asArray()->all(), 'id', 'name');