frontend/views/time-slots/_form.php

    <?php $form = ActiveForm::begin(); ?>

    <?php // $form->field($model, 'flight_id')->textInput() ?>
    <?= $form->field($model, 'flight_id')
        ->dropDownList( ArrayHelper::map(Flight::find()->where(['>', 'seats',0])->all(), 'id', 'name'),['prompt'=>'--Select Flight--'])
        ->label('FlightName'); ?>
---
SELECT * FROM `flight` WHERE `seats` > 0